
/*Ако имаме символен низ от символа char str[] = “Hello”; 
копирайте всеки един от неговите символи в низ, който да изглежда
огледален на него. Ето така char rts[] = “ollеH”; и принтирайте
резултата. 
...................................................................................................................*/


#include <stdio.h>
#include <string.h>

int main ()
{
char str [] = "Hello";
int count = 0;
count = strlen(str) -1;

for(int i = count; i >= 0; i--)
{
    printf("%c",str[i]); 
}
 

    return 0;
}


